app/Controllers/AjaxController.php

SELECT *
FROM `artikel`
---
    public function getData()
    {
        $model = new ArtikelModel();
        $data = $model->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '5'
---
    public function edit($id)
    {
        $model = new ArtikelModel();
        $data = $model->find($id);