app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 3, 3
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title'   => $title,
            'q'       => $q,
            'artikel' => $model->like('judul', $q)->paginate(3),