app/Controllers/Artikel.php

    public function admin_index()
    {
        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = (int) ($this->request->getVar('page') ?? 1);

        $model = new ArtikelModel();

        $builder = $model->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if (!empty($q)) {
            $builder->like('artikel.judul', $q);
        }

        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(5, 'default', $page);
---
SELECT *
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 5

        }

        $kategoriModel = new KategoriModel();
        return view('artikel/admin_index', [
            'kategori' => $kategoriModel->findAll(),
        ]);
---
SELECT *
FROM `kategori`

    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $gambar = '';
            if ($file && $file->isValid()) {
                $file->move(ROOTPATH . 'public/gambar');
                $gambar = $file->getName();
            }

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'gambar' => $gambar,
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `id_kategori`, `gambar`, `status`) VALUES ('Artikel AOT', 'aaaaaaaaaaaaa', 'Artikel-AOT', '6', NULL, 1)

        }

        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $artikel = new ArtikelModel();
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);
            return redirect()->to('/admin/artikel');
        }

        $data['artikel'] = $artikel->find($id);
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '7'
SELECT *
FROM `kategori`