app/Controllers/PostApi.php

    public function index()
    {
        $this->setCors();

        $model = new ArtikelModel();
        return $this->respond($model->findAll(), 200);
---
SELECT *
FROM `artikel`

    public function update($id = null)
    {
        $this->setCors();

        $model = new ArtikelModel();

        if (!$model->find($id)) {
            return $this->failNotFound("Data dengan ID $id tidak ditemukan");
        }

        parse_str(file_get_contents("php://input"), $data);

        if (empty($data['judul']) || empty($data['isi'])) {
            return $this->failValidationErrors('Judul dan isi harus diisi');
        }

        $model->update($id, $data);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '4'
UPDATE `artikel` SET `judul` = 'ini percobaaan artikel 2 bangetttttt', `isi` = 'Artikel 2 update bangett'
WHERE `artikel`.`id` IN ('4')

    public function delete($id = null)
    {
        $this->setCors();

        $model = new ArtikelModel();

        if (!$model->find($id)) {
            return $this->failNotFound("Data dengan ID $id tidak ditemukan");
        }

        $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '4'
DELETE FROM `artikel`
WHERE `id` IN ('4')