app/Models/ArtikelModel.php

    public function getArtikelDenganKategori()
    {
        // Pastikan 'kategori.id_kategori' sesuai dengan nama primary key di tabel kategori Anda.
        // Jika primary key tabel kategori adalah 'id', ubah menjadi 'kategori.id'.
        return $this->select('artikel.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                    ->orderBy('artikel.id', 'DESC')
                    ->findAll();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`